In [1]:
import pandas as pd

In [2]:
student=pd.read_csv("student.csv")
student.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [3]:
student.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [4]:
student.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [5]:
student_data=student.dropna(axis=0)

In [6]:
student_data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [7]:
y=student_data['math score']

In [8]:
y.head()

0    72
1    69
2    90
3    47
4    76
Name: math score, dtype: int64

In [9]:
student_data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [10]:
student_features=['reading score','writing score']
x=student_data[student_features]
x.head()

   reading score  writing score
0             72             74
1             90             88
2             95             93
3             57             44
4             78             75

In [11]:
from sklearn.tree import DecisionTreeRegressor
student_model=DecisionTreeRegressor(random_state=1)
student_model.fit(x,y)
student_model.predict(x.head())

array([65.2 , 76.25, 90.  , 47.  , 82.  ])

In [12]:
from sklearn.metrics import mean_absolute_error
predicted_marks=student_model.predict(x)
mean_absolute_error(predicted_marks,y)

3.3932619047619044

In [15]:
from sklearn.model_selection import train_test_split
train_x,val_x,train_y,val_y=train_test_split(x,y, random_state=20,test_size=0.50)
student_model.fit(train_x,train_y)
predicted_marks=student_model.predict(val_x)
mean_absolute_error(predicted_marks,val_y)

9.121366666666665

In [18]:
def get_mae(max_leaf_nodes, train_x, val_x, train_y, val_y):
    student_model = DecisionTreeRegressor(max_leaf_nodes=max_leaf_nodes, random_state=0)
    student_model.fit(train_x, train_y)
    predicted_marks = student_model.predict(val_x)
    mae = mean_absolute_error(val_y, predicted_marks)
    return(mae)

In [19]:
for max_leaf_nodes in [5, 50, 500, 5000]:
    my_mae = get_mae(max_leaf_nodes, train_x, val_x, train_y, val_y)
    print("Max leaf nodes: %d  \t\t Mean Absolute Error:  %d" %(max_leaf_nodes, my_mae))

Max leaf nodes: 5  		 Mean Absolute Error:  7
Max leaf nodes: 50  		 Mean Absolute Error:  8
Max leaf nodes: 500  		 Mean Absolute Error:  9
Max leaf nodes: 5000  		 Mean Absolute Error:  9

In [23]:
from sklearn.ensemble import RandomForestRegressor
student_model = RandomForestRegressor(max_leaf_nodes=max_leaf_nodes, random_state=0)
student_model.fit(train_x, train_y)
predicted_marks = student_model.predict(val_x)
print(mean_absolute_error(val_y, predicted_marks))

7.978962320388761

In [25]:
student_model.predict(val_x.head())

array([87.559     , 62.725     , 60.60666667, 65.95666667, 53.21      ])

In [26]:
y.head()

0    72
1    69
2    90
3    47
4    76
Name: math score, dtype: int64